In [9]:
# Find numbers in list occuring once only

x = [5,3,4,3,4,1,7,7,8]

for a in x:
    if (x.count(a))==1:
        print(a)

5
1
8

In [25]:
# Add digits of integer until the sum of digits is not a single digit number

n = 259

while (n > 9):
    n = sum(int(i) for i in str(n))
print(n)

7

# Regression Example

In [97]:
# Regression Sample

from sklearn.datasets import make_regression

features, target, coefficients = make_regression(n_samples=100, 
                                                 n_features=3, 
                                                 n_informative=3, 
                                                 n_targets=1, 
                                                 noise=0.0, 
                                                 coef=True,
                                                 random_state=1)

In [49]:
features[0:3] # just top 3 raws

array([[ 1.29322588, -0.61736206, -0.11044703],
       [-2.793085  ,  0.36633201,  1.93752881],
       [ 0.80186103, -0.18656977,  0.0465673 ]])

In [53]:
target[0:3] # just top 3 raws

array([-10.37865986,  25.5124503 ,  19.67705609])

In [46]:
coefficients

array([44.19042807, 98.97517077, 58.15774073])

In [98]:
df = pd.DataFrame(list(zip(features, target)),
               columns =['Features', 'Target'])
df.head()

                                            Features      Target
0  [1.2932258825322618, -0.6173620637123609, -0.1...  -10.378660
1  [-2.79308500014654, 0.36633201454005826, 1.937...   25.512450
2  [0.8018610318713447, -0.18656977190734877, 0.0...   19.677056
3  [0.12910157971072544, 0.5027408819999043, 1.61...  149.502054
4  [-0.691660751725309, -0.6871727001195994, -0.3... -121.652109

In [91]:
from sklearn.datasets import make_classification

features, target = make_classification(n_samples=100,
                                      n_features=3,
                                      n_informative=3,
                                      n_redundant=0,
                                      n_classes=2,
                                      weights=[.25,.75],
                                      random_state=1)

In [95]:
df = pd.DataFrame(list(zip(features, target)),
               columns =['Features', 'Target'])
df.head()

                                            Features  Target
0  [1.063547679835624, -1.4263221906642285, 1.021...       1
1  [0.231569771457817, 1.4953526072367407, 0.3325...       0
2  [0.15972950880274173, 0.8353351539777986, -0.4...       0
3  [-0.7061213282913767, -1.0328100311817383, 1.3...       1
4  [0.8444901981039752, -0.6199718924050266, 1.08...       1

In [104]:
url = 'https://raw.githubusercontent.com/chrisalbon/simulated_datasets/master/titanic.csv'
df = pd.read_csv(url)
df.head()

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.00,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.00,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
4,"Allison, Master Hudson Trevor",1st,0.92,male,1,0

In [86]:
df.shape

(1313, 6)

In [87]:
df.isnull().sum()

Name          0
PClass        0
Age         557
Sex           0
Survived      0
SexCode       0
dtype: int64

In [88]:
df.to_csv('titanic.csv')

In [100]:
df.describe()

              Age     Survived      SexCode
count  756.000000  1313.000000  1313.000000
mean    30.397989     0.342727     0.351866
std     14.259049     0.474802     0.477734
min      0.170000     0.000000     0.000000
25%     21.000000     0.000000     0.000000
50%     28.000000     0.000000     0.000000
75%     39.000000     1.000000     1.000000
max     71.000000     1.000000     1.000000

In [103]:
# let's try with unique values in a column
df['Survived'].unique()
df.head()

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.00,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.00,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
4,"Allison, Master Hudson Trevor",1st,0.92,male,1,0

In [102]:
df.describe()

              Age     Survived      SexCode
count  756.000000  1313.000000  1313.000000
mean    30.397989     0.342727     0.351866
std     14.259049     0.474802     0.477734
min      0.170000     0.000000     0.000000
25%     21.000000     0.000000     0.000000
50%     28.000000     0.000000     0.000000
75%     39.000000     1.000000     1.000000
max     71.000000     1.000000     1.000000

In [105]:
df['Survived'].value_counts()

0    863
1    450
Name: Survived, dtype: int64

In [108]:
# how many unique values
# nunique = number of unique values
df['Survived'].nunique()

2

In [118]:
# Create dataframe from lists

name = ['Pratik','Amandeep','Rabjot','Fahad']
grad = ['B','A+','A','A-']
score = [78,94,90,86]
mydict = {'names':name,'grades':grad,'score':score}
df = pd.DataFrame(mydict)
df.to_json('MyJSON.json')
df.to_csv('MyCSV.csv')
df

      names grades  score
0    Pratik      B     78
1  Amandeep     A+     94
2    Rabjot      A     90
3     Fahad     A-     86